# אפשר ליצור טאפלים בשני דרכים שונות
tup = 3, 4, "Dor", True
tup1 = (3, 4, "Dor", True)

# יוצרים רשימות בשימוש סוגריים מרובעים
lst = [3, 4, "Dor", False]

# מיון טאפלים ורשימות די זהה למיון מחרוזות
# מזה שהמיון מתחיל מ0
print(tup[0]) #=> 3
print(lst[3]) #=> False

# אי אפשר לשנות טאפלים אבל אפשר לשנות רשימות
#tup[2] = 4 השורה הזאת תיתן בעיה

# כך משנים את הפריט הרביעי של הרשימה
lst[3] = True #=> lst = [3,4,"Dor",True]

# אפשר ליצור מרשימות, טאפליםת ומחרוזות רשימות וטאפלים
new_tuple = tuple("Yes") #=> ("Y", "e", "s")
new_list = list("yes")  #=> ("Y", "e", "s")
