'''
ישנם 4/5 סוגים של טיפוסי נתונים בפייתון (יש עוד בשפות תכנות אחרות) והם:

1) int - מספרים שלמים
  לדוגמא: 12, 43, 65, 778, 8, 32145

2) float - נקודה צפה
  לדוגמא: 12.0 43.742 ו87654324.98765432
  
3) string - מחרוזת
  לדוגמא: "Hello", "How are you", "34567@!#231", '543243', 'lettersAND2312312'
  
4) Boolean - ערך אמת
  לדוגמא: True False
  
5) NULL - כלום
  לדוגמא: None
'''

# הנה כמה דוגמאות של משתנים
email = "spam@google.com"
year = 2016
percentage = 24.65
grade = "A+"
truth = True
lies = False
empty = None
func = print  # המשתנה שווה לפונקציית print
# func("Since my assigned value is a function, I take up its functionality :-) ")

# אפשר גם להכריז על כמה משתנים באותה שורה, זכרו שצריך להפריד בינהם עם פסיק, לדוגמא

best_country, founding_year, population = "Israel", 1948, 8462600

# זכרו גם ששם של משתנה יכול להכיל רק אותיות לטיניות וקו תחתון, ואסור לשם להתחיל עם מספר
# כמה דוגמאות לא טובות של שם משתנה שלא היו מתקבלות על ידי הקומפילר הם:

'''
9bad_VariableName = 78
?asd = 32
!@# = True
98 = print
'''

# אפשר גם לשנות את הטיפוס נתוני של משתנה עם הפונקציות ההבאות

a = 5
float(a)  # הופך את הפרמטר שלו וסוג נקודה צפה
int(a)    # הופך את הפרמטר שלו לסוג מספר שלם
str(a)    # הופך את הפרמטר שלו לסוג מחרוזת
bool(a)   # הופך את הפרמטר שלו לסוג ערך אמת

# ואפשר לבדוק גם את הטיפוס הנתוני של אובייקט עם הפונקציה ההבאה

type(5)
type(5.0)
type("a")
type(True)
type(None)
